In [2]:
import pandas as pd
import os

## 01_Basic_Analysis

Get current directory and load the file from a specific foldr:
- Q1: total number of members
- Q2: total number of members from CA
- Q3: total number of activities from USA 
- (assume USA == US and there're more rows unshown in the table)
- Q4: which country members are more active in 2019?

In [3]:
cwd = os.getcwd()

In [6]:
df_mem = pd.read_csv("dataset1/members.csv", sep=",")
df_act = pd.read_csv("dataset1/activity.csv", sep=",")

In [5]:
df_mem

   memberID country   enroll_dt
0     12345     USA  2019-10-01
1     12356     USA  2019-05-02
2     23456     USA  2016-01-03
3     23478     USA  2018-01-04
4     12378      CA  2019-03-05
5     23469      CA  2017-01-05

In [6]:
df_act

   memberID activity_dt  activity
0     12345  2019-09-01      view
1     12356  2019-05-02      view
2     12345  2019-02-03      view
3     12356  2019-04-04      view
4     23469  2019-03-05      view
5     23469  2019-06-05  purchase

In [8]:
# Q1: total number of members

df_mem.memberID.nunique()

6

In [12]:
# Q2: total number of members from CA

df_mem_CA = df_mem[df_mem['country']=='CA']
df_mem_CA

   memberID country   enroll_dt
4     12378      CA  2019-03-05
5     23469      CA  2017-01-05

In [13]:
df_mem_CA.memberID.nunique()

2

In [18]:
df_mem[df_mem['country']=='CA'].memberID.nunique() # combine above 2

2

In [14]:
# Q3: total number of activities from CA

df_merge = pd.merge(df_mem, df_act, how='left', on=['memberID'])
df_merge

   memberID country   enroll_dt activity_dt  activity
0     12345     USA  2019-10-01  2019-09-01      view
1     12345     USA  2019-10-01  2019-02-03      view
2     12356     USA  2019-05-02  2019-05-02      view
3     12356     USA  2019-05-02  2019-04-04      view
4     23456     USA  2016-01-03         NaN       NaN
5     23478     USA  2018-01-04         NaN       NaN
6     12378      CA  2019-03-05         NaN       NaN
7     23469      CA  2017-01-05  2019-03-05      view
8     23469      CA  2017-01-05  2019-06-05  purchase

In [16]:
df_merge.activity.count()

6

In [17]:
df_merge[df_merge['country']=='CA'].activity.count()

2

In [19]:
# Q4: which country members are more active in 2019?

df_merge.groupby(['country']).count()

         memberID  enroll_dt  activity_dt  activity
country
CA              3          3            2         2
USA             6          6            4         4

In [20]:
df_agg = df_merge.groupby(['country']).count()